_posts/2019-01-21-writing-for-eternity.html
---
title: Writing for eternity
---
<p>
Something I would like to do more this year is to share my thoughts
with a teacher mindset.
</p>

<p>
I would like to do so for two main reasons:
</p>

<ul class="org-ul">
<li>Improve my learning. Teaching is one of the best way to learn</li>
<li>Happiness. I genuinely enjoy sharing things that I consider useful.</li>
</ul>

<p>
To do this I would like to write with the idea that my website will
survive me and stay available after my death. This way what I learned
will be useful for a very long period of time. It could even be useful
as Archaeological content for future History teachers. I am dreaming a
lot here but It is useful to start with the end goal in mind.
</p>

<p>
So <b>the first step</b> is to find a permanent home for my website. This
permanent home should be free so that even after my death, not paying
hosting bills will not mean the deletion of my website.
</p>

<p>
My current strategy is to host my website on <a href="https://pages.github.com/">GitHub pages</a>. GitHub is
one (the?) largest code repository for developers. It was bought by
Microsoft a few month ago. Those are signs that GitHub should stay up
for a pretty long time. Also it is currently free to host a website
using GitHub pages.
</p>

<p>
<b>The second step</b> is to repeat the first step. I am not comfortable
entrusting the future of my website to one single organization. Thus I
need mirrors for my websites and I have set up something similar to
GitHub pages on <a href="https://pages.bitbucket.io/">Bitbucket</a>.
</p>

<p>
My website is now accessible at:
</p>
<ul class="org-ul">
<li><a href="https://aurelienbottazini.github.io/">https://aurelienbottazini.github.io/</a></li>
<li><a href="https://aurelienbottazini.bitbucket.io/">https://aurelienbottazini.bitbucket.io/</a></li>
</ul>

<p>
Both repositories are also public:
</p>
<ul class="org-ul">
<li><a href="https://github.com/aurelienbottazini/aurelienbottazini.github.io">https://github.com/aurelienbottazini/aurelienbottazini.github.io</a></li>
<li><a href="https://bitbucket.org/aurelienbottazini/aurelienbottazini.bitbucket.io/src/master/">https://bitbucket.org/aurelienbottazini/aurelienbottazini.bitbucket.io/src/master/</a></li>
</ul>

<p>
I will try to add more mirrors in the future.
</p>
